rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    @movie = Movie.find params[:id]

    if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "LOL"]]